Afip/src/XMLs/FECAESolicitarLargo.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:ar="http://ar.gov.afip.dif.FEV1/">
	<soapenv:Header/>
	<soapenv:Body>
		<ar:FECAESolicitar>
			<ar:Auth>
				<ar:Token>string</ar:Token>
				<ar:Sign>string</ar:Sign>
				<ar:Cuit>long</ar:Cuit>
			</ar:Auth>
			<ar:FeCAEReq>
				<ar:FeCabReq>
					<ar:CantReg>int</ar:CantReg>
					<ar:PtoVta>int</ar:PtoVta>
					<ar:CbteTipo>int</ar:CbteTipo>
				</ar:FeCabReq>
				<ar:FeDetReq>
					<ar:FECAEDetRequest>
						<ar:Concepto>int</ar:Concepto>
						<ar:DocTipo>int</ar:DocTipo>
						<ar:DocNro>long</ar:DocNro>
						<ar:CbteDesde>long</ar:CbteDesde>
						<ar:CbteHasta>long</ar:CbteHasta>
						<ar:CbteFch>string</ar:CbteFch>
						<ar:ImpTotal>double</ar:ImpTotal>
						<ar:ImpTotConc>double</ar:ImpTotConc>
						<ar:ImpNeto>double</ar:ImpNeto>
						<ar:ImpOpEx>double</ar:ImpOpEx>
						<ar:ImpTrib>double</ar:ImpTrib>
						<ar:ImpIVA>double</ar:ImpIVA>
						<ar:FchServDesde>string</ar:FchServDesde>
						<ar:FchServHasta>string</ar:FchServHasta>
						<ar:FchVtoPago>string</ar:FchVtoPago>
						<ar:MonId>string</ar:MonId>
						<ar:MonCotiz>double</ar:MonCotiz>
						<ar:CbtesAsoc>
							<ar:CbteAsoc>
								<ar:Tipo>short</ar:Tipo>
								<ar:PtoVta>int</ar:PtoVta>
								<ar:Nro>Long</ar:Nro>
								<ar:Cuit>String</ar:Cuit>
								<ar:CbteFch>String</ar:CbteFch>
							</ar:CbteAsoc>
						</ar:CbtesAsoc>
						<ar:Tributos>
							<ar:Tributo>
								<ar:Id>short</ar:Id>
								<ar:Desc>string</ar:Desc>
								<ar:BaseImp>double</ar:BaseImp>
								<ar:Alic>double</ar:Alic>
								<ar:Importe>double</ar:Importe>
							</ar:Tributo>
						</ar:Tributos>
						<ar:Iva>
							<ar:AlicIva>
								<ar:Id>short</ar:Id>
								<ar:BaseImp>double</ar:BaseImp>
								<ar:Importe>double</ar:Importe>
							</ar:AlicIva>
						</ar:Iva>
						<ar:Opcionales>
							<ar:Opcional>
								<ar:Id>string</ar:Id>
								<ar:Valor>string</ar:Valor>
							</ar:Opcional>
						</ar:Opcionales>
						<ar:Compradores>
							<ar:Comprador>
								<ar:DocTipo>int</ar:DocTipo>
								<ar:DocNro>Long</ar:DocNro>
								<ar:Porcentaje>double</ar:Porcentaje>
							</ar:Comprador>
						</ar:Compradores>
						<ar:PeriodoAsoc>
							<ar:FchDesde>string</ar:FchDesde>
							<ar:FchHasta>string</ar:FchHasta>
						</ar:PeriodoAsoc>
					</ar:FECAEDetRequest>
				</ar:FeDetReq>
			</ar:FeCAEReq>
		</ar:FECAESolicitar>
	</soapenv:Body>
</soapenv:Envelope>